//===================================================================================================
// Summary:
//		整机配置模块使用的公用函数
// Date:
//		2016-12-01
// Author:
//		lgq
//===================================================================================================

#pragma once

//===================================================================================================

// 全局变量定义

// 机柜模板参数_宽
extern CString g_strITParaWidthName;
// 机柜模板参数_深
extern CString g_strITParaDepthName;
// 机柜模板参数_高
extern CString g_strITParaHeightName;

// 服务器机柜装配坐标
extern CString g_strFWQJGCompCsysName;

// 机柜模板组件名称
extern CString g_strFWQJGTemplateAsmName;

//===================================================================================================

// 根据布局图符号类型获取设计用组件类型
int GetDesignModelType(int nSymbolSubtype);
// 初始化全局变量
bool InitDesignGlobalData();

//===================================================================================================

