//===================================================================================================
// Summary:
//		ProEComLib内部使用常量和结构体
// Date:
//		2015-07-02			创建，增加相等判定宏
// Author:
//		Liuguoqing(bjliugq@qq.com)
//===================================================================================================

#ifndef __PCLConst_h__
#define __PCLConst_h__

//===================================================================================================
// 以下为宏定义

// 删除选择对象
#define SAFE_DELETE_SELECTION(p) \
{ \
	if (NULL != p) \
	ProSelectionFree(&p); \
	p = NULL; \
}

// 删除ProArray数组
#define SAFE_DELETE_PROARRAY(p) \
{ \
	if (NULL != p) \
	ProArrayFree((ProArray*)&p); \
	p = NULL; \
}

// 比较宏
#define GREATER_EQUAL(x, y) (ISDEQUAL((x), (y)) || (x) > (y))
#define LESS_EQUAL(x, y) (ISDEQUAL((x), (y)) || (x) < (y))
#define GREATER_NEAR(x, y) (ISDNEAR((x), (y)) || (x) > (y))
#define LESS_NEAR(x, y) (ISDNEAR((x), (y)) || (x) < (y))

//===================================================================================================
// 以下为常量定义


//===================================================================================================
// 以下为枚举值定义

// 模型类型过滤器
typedef enum __tagModelTypeFilter
{
	MTF_ASSEMBLY		= 0x0001,	// 组件
	MTF_PART			= 0x0002,	// 零件
	MTF_DRAWING			= 0x0004,	// 工程图
} ModelTypeFilter;

//===================================================================================================
// 以下为结构体定义


//===================================================================================================

#endif